using Microsoft.EntityFrameworkCore.Migrations;

#nullable disable

namespace FIHS.Migrations
{
    /// <inheritdoc />
    public partial class seedPlantSoilsRelation : Migration
    {
        /// <inheritdoc />
        protected override void Up(MigrationBuilder migrationBuilder)
        {
                        migrationBuilder.InsertData(
                table: "PlantSoilTypes",
                columns: new[] { "PlantId", "SoilId" },
                values: new object[,]
                {
                    { 9, 6 }, //ريحان في التربة الجيرية
                    { 10, 1 }, // بقدونس في التربة الطينية
                    { 11, 4 }, // نعناع في التربة الطينية الطميية
                    { 12, 2 }, // زعتر في التربة الرملية
                    { 13, 5 }, // حبق في التربة الطينية الرملية
                    { 14, 4 }, // بابونج في التربة الطينية الطميية
                    { 15, 1 }, // مردقوش في التربة الطينية
                    { 16, 5 }, // كركم في التربة الطينية الرملية
                    { 17, 1 }, // بابونج ألماني في التربة الطينية
                    { 18, 2 }, // حشيشة الليمون في التربة الرملية
                    { 19, 3 }, // نبتة العرن المثقوب في التربة الحصوية
                    { 20, 1 }, // مرمية في التربة الطينية
                    { 21, 1 }, // حشيشة الملاك في التربة الطينية
                    { 22, 4 }, // قراص في التربة الطينية الطميية
                    { 23, 2 }, // شمر في التربة الرملية
                    { 24, 1 }, // نبات الأذريون في التربة الطينية
                    { 25, 1 }, // زوفا في التربة الطينية
                    { 26, 1 }, // عرعر في التربة الطينية
                    { 27, 5 }, // زيتون في التربة الطينية الرملية
                    { 28, 1 }, // نخيل التمر في التربة الطينية
                    { 29, 1 }, // رمان في التربة الطينية
                    { 30, 2 }, // تين في التربة الرملية
                    { 31, 1 }, // تفاح في التربة الطينية
                    { 32, 2 }, // برتقال في التربة الرملية
                    { 33, 1 }, // ليمون في التربة الطينية
                    { 34, 3 }, // مانجو في التربة الحصوية
                    { 35, 2 }, // أفوكادو في التربة الرملية
                    { 36, 1 }, // كيوي في التربة الطينية
                    { 37, 2 }, // رودودندرون في التربة الرملية
                    { 38, 3 }, // الغار في التربة الحصوية
                    { 39, 1 }, // الياسمين في التربة الطينية
                    { 40, 2 }, // أزاليا في التربة الرملية
                    { 41, 1 }, // الدفلى في التربة الطينية
                    { 42, 2 }, // الكاميليا في التربة الرملية
                    { 43, 1 }, // الغاردينيا في التربة الطينية
                    { 44, 3 }, // البوكسوود في التربة الحصوية
                    { 45, 4 }, // بيريس في التربة الطينية الطميية
                    { 46, 3 }, // الروزماري في التربة الحصوية
                    { 47, 1 }, // ألوة فيرا في التربة الطينية
                    { 48, 2 }, // صبار الإجاص الشائك في التربة الرملية
                    { 49, 1 }, // سنسفيرا في التربة الطينية
                    { 50, 4 }, // أغاف في التربة الطينية الطميية
                    { 51, 4 }, // صبار الهوديا في التربة الطينية الطميية
                    { 52, 6 }, // صبار زيبرينا في التربة الجيرية
                    { 53, 5 }, // صبار البارليريا في التربة الطينية الرملية
                    { 54, 3 }, // صبار القنفذ في التربة الحصوية
                    { 55, 4 }, // ألوة عريضة الأوراق في التربة الطينية الطميية
                    { 56, 1 }, // صبار كريسولا في التربة الطينية
                    { 57, 2 }, // زهرة العسل في التربة الرملية
                    { 58, 1 }, // ياسمين في التربة الطينية
                    { 59, 3 }, // لبلاب إنجليزي في التربة الحصوية
                    { 60, 4 }, // بوجنفيليا في التربة الطينية الطميية
                    { 61, 2 }, // وردة المتسلق في التربة الرملية
                    { 62, 1 }, // زهرة الساعة في التربة الطينية
                    { 63, 3 }, // كرمة الفلامنجو في التربة الحصوية
                    { 64, 4 }, // كرمة العشق في التربة الطينية الطميية
                    { 65, 1 }, // زهرة الصباح في التربة الطينية
                    { 66, 2 }, // متسلق الجهنمية في التربة الرملية
                    { 67, 3 }, // سرو في التربة الحصوية
                    { 68, 1 }, // سرو كريت في التربة الطينية
                    { 69, 2 }, // سرو لاوير في التربة الرملية
                    { 70, 4 }, // شجرة الصنوبر في التربة الطينية الطميية
                    { 71, 2 }, // شجرة الصنوبر الأبيض في التربة الرملية
                    { 72, 1 }, // سرو كاليفورنيا في التربة الطينية
                    { 73, 3 }, // سرو بالوتيا في التربة الحصوية
                    { 74, 1 }, // سرو كريبتومرا في التربة الطينية
                    { 75, 2 }, // أرز لبناني في التربة الرملية
                    { 76, 4 }, // صنوبر بحري في التربة الطينية الطميية
                    { 77, 1 }, // البلبل المائي في التربة الطينية
                    { 78, 2 }, // السوسنة المائية في التربة الرملية
                    { 79, 3 }, // البامية المائية في التربة الحصوية
                    { 80, 1 }, // القرنفل المائي في التربة الطينية
                    { 81, 2 }, // الأزولا المائية في التربة الرملية
                    { 82, 4 }, // الأزولا المائية الحمراء في التربة الطينية الطميية
                    { 83, 3 }, // الباربيندو في التربة الحصوية
                    { 84, 1 }, // الهوتيا في التربة الطينية
                    { 85, 2 }, // البينيا في التربة الرملية
                    { 86, 4 }, // المستنقعات في التربة الطينية الطميية
                    { 87, 3 }, // الفاوانيا المائية في التربة الحصوية
                    { 88, 1 }, // الكركديه البري في التربة الطينية
                    { 89, 2 }, // الخس البري في التربة الرملية
                    { 90, 3 }, // العرعر البري في التربة الحصوية
                    { 91, 4 }, // الزعرور البري في التربة الطينية الطميية
                    { 92, 1 }, // الشمام البري في التربة الطينية
                    { 93, 2 }, // السعد البري في التربة الرملية
                    { 94, 3 }, // البابونج البري في التربة الحصوية
                    { 95, 1 }, // الأقحوان البري في التربة الطينية
                    { 96, 2 }, // القرنفل البري في التربة الرملية
                    { 97, 4 }, // اللوز في التربة الطينية الطميية
                    { 98, 1 }, // الزنجبيل في التربة الطينية
                    { 99, 2 } , // العنب في التربة الرملية
                    { 100, 3 }, // الكرفس في التربة الحصوية
                    { 101, 4 }, // الصبار في التربة الطينية الطميية
                    { 102, 1 }, // العين الجملية في التربة الطينية
                    { 103, 2 }, // الأغاف في التربة الرملية
                    { 104, 3 },  // البتولا الصحراوية في التربة الحصوية
                    { 105, 4 }  // السمار الصحراوي في التربة الطينية الطميية
                            });
        }

        /// <inheritdoc />
        protected override void Down(MigrationBuilder migrationBuilder)
        {

        }
    }
}
