using Microsoft.EntityFrameworkCore.Migrations;

#nullable disable

namespace FIHS.Migrations
{
    /// <inheritdoc />
    public partial class seedPestData : Migration
    {
        /// <inheritdoc />
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.InsertData(
                table: "Pests",
                columns: new[] { "Species", "Name", "ScientificName", "DamageSymptoms", "ControlMethods", "Description", "LifeCycle", "GeographicDistribution", "Reproduction" },
                values: new object[,]
                {
                     { "الديدان", "ديدان الطماطم", "Helicoverpa armigera", "تغذية على الثمار والأوراق", "استخدام الفحص اليدوي والتدابير الزراعية المناسبة", "ديدان تتغذى على الثمار والأوراق مما يؤثر على محصول الطماطم", " تتغذى على الثمار والأوراق وتتسبب في تلفها.", "منتشرة في مناطق الزراعة للطماطم في جميع أنحاء العالم", "التكاثر بواسطة التكاثر الجنسي" },
                     { "الديدان", "ديدان الحبوب", "Sitotroga cerealella", "تغذية على الحبوب المخزنة", "استخدام الفحص اليدوي وتدابير مكافحة الآفات", "ديدان تصيب الحبوب المخزنة وتؤدي إلى خسائر كبيرة", " تتغذى على الحبوب المخزنة وتلتصق بالأسطح الداخلية للتخزين.", "منتشرة في مناطق الزراعة والتخزين", "التكاثر بواسطة التكاثر الجنسي" },
                     { "الديدان", "ديدان الخيار", "Helicoverpa zea", "تغذية على الثمار والأوراق", "استخدام الفحص اليدوي والتدابير الزراعية المناسبة", "ديدان تتغذى على الثمار والأوراق مما يؤثر على محصول الخيار", " تتغذى على الثمار والأوراق وتتسبب في تلفها.", "منتشرة في مناطق زراعة الخيار في جميع أنحاء العالم", "التكاثر بواسطة التكاثر الجنسي" },
                     { "الديدان", "ديدان القمح", "Hessian fly", "تغذية على الأوراق والسيقان", "استخدام تقليم السيقان المصابة ومكافحة الآفات", "ديدان تتسبب في تلف أوراق القمح وتؤثر على إنتاجيته", " تتغذى على الأوراق وتتسبب في تشويه السيقان.", "منتشرة في مزارع القمح في المناطق الحارة والمعتدلة", "التكاثر بواسطة التكاثر الجنسي" },
                     { "الديدان", "ديدان الخوخ", "Grapholita molesta", "تغذية على الثمار", "استخدام الفحص اليدوي ومكافحة الآفات المناسبة", "ديدان تهاجم ثمار الخوخ وتتسبب في تلفها وتدهور جودتها", " تتغذى على ثمار الخوخ وتؤثر على نضجها وجودتها.", "منتشرة في مزارع الخوخ في جميع أنحاء العالم", "التكاثر بواسطة التكاثر الجنسي" },
                     { "الديدان", "ديدان العنب", "Lobesia botrana", "تغذية على الثمار والأوراق", "استخدام الفحص اليدوي وتدابير مكافحة الآفات", "ديدان تصيب الثمار والأوراق لنبات العنب وتتسبب في خسائر في المحصول", " تتغذى على الثمار والأوراق وتتسبب في تلفها وتقوم بإفساد العنب.", "منتشرة في مناطق زراعة العنب في جميع أنحاء العالم", "التكاثر بواسطة التكاثر الجنسي" },
                     { "الديدان", "ديدان التربة", "Lumbricus terrestris", "حفر في التربة", "استخدام التهوية التربة", "ديدان تساهم في تحسين جودة التربة وتهويتها", " تتغذى على المواد العضوية في التربة وتقوم بحفر الأنفاق التي تساعد في تهوية التربة وتخفيف ضغطها.", "منتشرة في جميع أنحاء العالم", "التكاثر بواسطة الانقسام الجسدي أو تبيض الأنثى" },
                     { "الديدان", "ديدان الأرز", "Eisenia fetida", "تفريق المواد العضوية", "استخدام تحويل المخلفات العضوية", "ديدان تستخدم في تحويل المخلفات العضوية إلى سماد عضوي", " تتغذى على المواد العضوية المتحللة وتقوم بتفريقها داخل التربة.", "منتشرة في البيئات الحضرية والريفية", "التكاثر بواسطة التفريخ الجنسي وتكاثر الأسرة" },
                     { "الديدان", "ديدان الأميال", "Perionyx excavatus", "تفريق المواد العضوية", "استخدام تحويل المخلفات العضوية", "ديدان تساعد في تحويل المخلفات العضوية إلى سماد عضوي", " تتغذى على المواد العضوية وتقوم بتفريقها داخل التربة.", "منتشرة في المناطق الحارة والمعتدلة", "التكاثر بواسطة التفريخ الجنسي" },
                     { "الديدان", "ديدان الطين", "Megascolex coeruleus", "تفريق التربة", "استخدام تحسين جودة التربة", "ديدان تساهم في تحسين جودة التربة وتهويتها", " تتغذى على المواد العضوية وتقوم بتفريق التربة داخل أنفاقها.", "منتشرة في المناطق الحارة والمعتدلة", "التكاثر بواسطة التفريخ الجنسي" },
                     { "الديدان", "ديدان الأنكليس", "Aporrectodea caliginosa", "تفريق المواد العضوية", "استخدام تحسين جودة التربة", "ديدان تساهم في تحسين جودة التربة وتهويتها", " تتغذى على المواد العضوية وتقوم بتفريقها داخل التربة.", "منتشرة في المناطق الباردة والمعتدلة", "التكاثر بواسطة التفريخ الجنسي" },
                     { "الحشرات", "دودة البذور", "Helicoverpa armigera", "تلف في الثمار والبذور", "استخدام مبيدات الحشرات", "يرقات تتغذى على الثمار والبذور", " تتكاثر بسرعة في المناطق الدافئة والرطبة. تبيض الأنثى البيض في الثمار والبذور. اليرقات تتغذى على الثمار والبذور قبل التحول إلى حالة حشرية بالغة.", "شائعة في المناطق الحارة والمعتدلة حول العالم", "التكاثر بواسطة تبيض الأنثى في الثمار والبذور" },
                     { "الحشرات", "ذبابة البطاطس", "Leptinotarsa decemlineata", "أوراق مثقوبة", "استخدام مبيدات الحشرات", "حشرة تصيب نباتات البطاطس", " تبيض الأنثى البيض على أوراق البطاطس. اليرقات تتغذى على الأوراق والسيقان قبل التحول إلى حالة بالغة.", "منتشرة في المناطق الحارة والمعتدلة حول العالم", "التكاثر بواسطة تبيض الأنثى على أوراق البطاطس" },
                     { "الحشرات", "دودة القطن", "Helicoverpa armigera", "تلف في الثمار والبذور", "استخدام مبيدات الحشرات", "يرقات تتغذى على الثمار والبذور", " تتكاثر بسرعة في المناطق الدافئة والرطبة. تبيض الأنثى البيض في الثمار والبذور. اليرقات تتغذى على الثمار والبذور قبل التحول إلى حالة حشرية بالغة.", "شائعة في المناطق الحارة والمعتدلة حول العالم", "التكاثر بواسطة تبيض الأنثى في الثمار والبذور" },
                     { "الحشرات", "العنكبوت الأحمر", "Tetranychus urticae", "تساقط الأوراق", "استخدام مبيدات الحشرات الحيوية", "حشرة تصيب الأوراق بالرغمرة", " تتكاثر بسرعة في المناطق الدافئة والجافة. تبيض الأنثى البيض على الأوراق. تتغذى اليرقات والبالغة على النسيج الخضري.", "انتشار واسع في المناطق الحارة والجافة حول العالم", "التكاثر بواسطة تبيض الأنثى على الأوراق وتغذية اليرقات والبالغة على النسيج الخضري" },
                     { "الحشرات", "سوسة الفاكهة", "Halyomorpha halys", "ثقوب في الثمار", "استخدام الفخاخ اللزجة", "حشرة تصيب الفواكه المختلفة", " تتكاثر بسرعة في الظروف الدافئة والرطبة. تبيض الأنثى البيض في الثمار. اليرقات تتغذى على الثمار قبل التحول إلى حالة بالغة.", "شائعة في المناطق الحارة والمعتدلة حول العالم", "التكاثر بواسطة تبيض الأنثى في الثمار" },
                     { "الحشرات", "دودة البنجر", "Agrotis ipsilon", "تلف في الجذور والسيقان", "استخدام مبيدات الحشرات", "يرقات تتغذى على الجذور والسيقان", " تتكاثر بسرعة في المناطق الرطبة. تبيض الأنثى البيض في التربة بالقرب من النباتات. اليرقات تتغذى على الجذور والسيقان قبل التحول إلى حالة بالغة.", "شائعة في المناطق الحارة والمعتدلة حول العالم", "التكاثر بواسطة تبيض الأنثى في التربة وتغذية اليرقات على الجذور والسيقان" },
                     { "الحشرات", "ذبابة الفاكهة", "Bactrocera dorsalis", "ثقوب في الفاكهة", "استخدام الفخاخ", "حشرة تصيب الفاكهة", " تبيض الذبابة الإناث في الفاكهة المستضافة. اليرقات تنمو وتتغذى على الفاكهة قبل أن تنضج وتطفو على السطح. ثم تصبح اليرقات يراقات وتتحول إلى حالة بالغة وتختبئ داخل التربة.", "منتشرة في المناطق الحارة والمعتدلة حول العالم", "التكاثر بواسطة تبيض الذبابة الإناث في الفواكه المستضافة" },
                     { "الحشرات", "حفار الساق", "Ostrinia nubilalis", "ثقوب في السيقان", "استخدام أصناف مقاومة", "حشرة تحفر في سيقان النباتات", " تبيض الأنثى داخل السيقان أو السيقان الناضجة. يتغذى اليرقات على الأنسجة الناعمة داخل السيقان قبل التحول إلى حالة حشرية بالغة والخروج للتغذية السطحية.", "منتشرة في المناطق الحارة والمعتدلة حول العالم", "التكاثر بواسطة تبيض الأنثى داخل سيقان النباتات" },
                     { "الحشرات", "ديدان الجذور", "Meloidogyne spp.", "تضخم الجذور", "تناوب المحاصيل", "ديدان تصيب جذور النباتات", " تبيض الأنثى داخل التربة الرطبة. تخترق اليرقات الجذور وتتغذى عليها مما يؤدي إلى تضخم الجذور وتشوهها.", "منتشرة عالمياً في التربة المعتدلة والرطبة", "التكاثر بواسطة تبيض الأنثى داخل التربة واختراق اليرقات الجذور" },
                     { "الحشرات", "ذبابة الثمار", "Drosophila suzukii", "ثقوب في الثمار", "استخدام الفخاخ اللزجة", "حشرة تصيب الثمار", " تبيض الأنثى داخل الثمار. اليرقات تتغذى على الثمار الناضجة وتتحول إلى حالة حشرية بالغة.", "شائعة في المناطق الحارة والمعتدلة حول العالم", "التكاثر بواسطة تبيض الأنثى داخل الثمار المستضافة" },
                     { "الحشرات", "صرصور الخضر", "Blattella germanica", "أثار وفضلات", "استخدام مبيدات الحشرات", "حشرة تصيب المخازن والمطابخ", " تتكاثر بسرعة في المناطق الدافئة والرطبة داخل المنازل والمطابخ والمخازن. تضع الأنثى البيض في الفجوات وتحت الأشياء المواد الطبيعية المتاحة للتغذية.", "انتشار واسع في المناطق الحضرية حول العالم", "التكاثر بواسطة البيض الذي تضعه الأنثى في الفجوات والأماكن المظلمة" }
                });
        }

        /// <inheritdoc />
        protected override void Down(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.Sql("Delete From [Pests]");
        }
    }
}
